[
  {"id":"a1-001","level":"A1","title":"My First Words","summary":"Learn basic words and greetings in English. Practice common phrases for everyday conversations.","content":"This is a simple article about greetings and basic nouns for A1 learners.","image":null},
  {"id":"a1-002","level":"A1","title":"Numbers and Colors","summary":"Learn how to count and describe colors in English. Essential vocabulary for beginners.","content":"Practice numbers from 1 to 100 and learn common color names.","image":null},
  {"id":"a1-003","level":"A1","title":"My Family","summary":"Talk about your family members in English. Learn vocabulary for describing relatives.","content":"Learn how to introduce your family and describe family relationships.","image":null},
  {"id":"a2-001","level":"A2","title":"My Favorite Hobby","summary":"Learn how to talk about hobbies and free-time activities in English. Practice vocabulary for daily routines and interests.","content":"Learn how to talk about hobbies and free-time activities in English. Practice vocabulary for daily routines and interests.","image":null},
  {"id":"a2-002","level":"A2","title":"A Day at the Park","summary":"Learn how to talk about daily activities and outdoor routines in English. Practice vocabulary for places, actions, and simple sentences.","content":"Learn how to talk about daily activities and outdoor routines in English. Practice vocabulary for places, actions, and simple sentences.","image":null},
  {"id":"a2-003","level":"A2","title":"My Favorite Food","summary":"Learn how to describe food and meals in English. Practice vocabulary for tastes, ingredients, and expressing likes and dislikes.","content":"Learn how to describe food and meals in English. Practice vocabulary for tastes, ingredients, and expressing likes and dislikes.","image":null},
  {"id":"b1-001","level":"B1","title":"Travel Adventures","summary":"Talk about travel experiences and destinations. Practice vocabulary for planning trips.","content":"Learn how to describe your travel experiences and talk about different destinations around the world.","image":null},
  {"id":"b1-002","level":"B1","title":"Shopping Experience","summary":"Learn vocabulary for shopping and making purchases. Practice conversations in stores.","content":"Develop your skills in shopping conversations, asking for products, and discussing prices.","image":null},
  {"id":"b1-003","level":"B1","title":"Health and Fitness","summary":"Discuss health topics and fitness routines. Learn medical vocabulary.","content":"Practice talking about health, symptoms, and maintaining a healthy lifestyle.","image":null},
  {"id":"b2-001","level":"B2","title":"Work and Career","summary":"Describe jobs and workplace vocabulary. Learn professional English for career development.","content":"Expand vocabulary around occupations, responsibilities, and professional settings.","image":null},
  {"id":"b2-002","level":"B2","title":"Technology Today","summary":"Discuss modern technology and its impact. Learn tech-related vocabulary.","content":"Explore vocabulary for discussing technology, gadgets, and digital trends.","image":null},
  {"id":"b2-003","level":"B2","title":"Environmental Issues","summary":"Talk about the environment and sustainability. Learn vocabulary for discussing climate.","content":"Develop your ability to discuss environmental challenges and sustainable solutions.","image":null},
  {"id":"c1-001","level":"C1","title":"Debates and Opinions","summary":"Expressing nuanced opinions and arguments. Learn advanced discussion techniques.","content":"Practice advanced structures to agree, disagree, and present arguments clearly.","image":null},
  {"id":"c1-002","level":"C1","title":"Cultural Differences","summary":"Analyze cultural perspectives and social norms. Discuss cross-cultural communication.","content":"Explore how different cultures approach communication, business, and social interactions.","image":null},
  {"id":"c1-003","level":"C1","title":"Media and Influence","summary":"Examine media's role in society. Discuss journalism and information spread.","content":"Analyze how media shapes public opinion and the responsibility of journalists.","image":null},
  {"id":"c2-001","level":"C2","title":"Literature Analysis","summary":"Analyze texts and infer deeper meanings. Master literary criticism techniques.","content":"High-level reading comprehension and critical analysis for experienced learners.","image":null},
  {"id":"c2-002","level":"C2","title":"Philosophy and Ethics","summary":"Discuss complex philosophical concepts. Debate ethical dilemmas.","content":"Engage with abstract philosophical ideas and examine ethical frameworks.","image":null},
  {"id":"c2-003","level":"C2","title":"Academic Writing","summary":"Master formal academic writing styles. Learn research and citation techniques.","content":"Perfect your academic writing with advanced structures, formal language, and proper citations.","image":null}
]
